teste-performance/code group.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: cODE GROUP-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: cODE GROUP-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  cODE GROUP-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1366,641)
      - go(https://www.amazon.com.br/)
      - waitForByID(twotabsearchtextbox,Clickable): 10s
      - clickByID(twotabsearchtextbox)
      - waitForByID(twotabsearchtextbox,Clickable): 10s
      - typeByID(twotabsearchtextbox): "SMA"
      - waitForByID(twotabsearchtextbox,Clickable): 10s
      - keysByID(twotabsearchtextbox): KEY_DOWN
      - waitForByID(twotabsearchtextbox,Clickable): 10s
      - keysByID(twotabsearchtextbox): KEY_DOWN
      - waitForByID(twotabsearchtextbox,Clickable): 10s
      - keysByID(twotabsearchtextbox): KEY_ENTER
      - waitForByCSS([data-image-latency],Clickable): 10s
      - clickByCSS([data-image-latency])
      - waitForByID(add-to-cart-button,Clickable): 10s
      - clickByID(add-to-cart-button)
      - waitForByCSS(#attach_add_accessory_button_0-0 > span.a-button-inner > input.a-button-input,Clickable): 10s
      - clickByCSS(#attach_add_accessory_button_0-0 > span.a-button-inner > input.a-button-input)
      - waitForByCSS(#attach-sidesheet-view-cart-button > span.a-button-inner > input.a-button-input,Clickable): 10s
      - clickByCSS(#attach-sidesheet-view-cart-button > span.a-button-inner > input.a-button-input)
      - waitForByCSS(span.hm-icon-label,Clickable): 10s
      - clickByCSS(span.hm-icon-label)
      - waitForByCSS(a.hmenu-item,Clickable): 10s
      - clickByCSS(a.hmenu-item)
      - waitForByLinkText(Alimentos e Bebidas,Clickable): 10s
      - clickByLinkText(Alimentos e Bebidas)

  cODE GROUP-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="135", "Not-A.Brand";v="8", "Chromium";v="135"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/135.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://www.amazon.com.br/s
            method: GET
            label: https://www.amazon.com.br/s
            think-time: 0ms
            headers:
              device-memory: '8'
              sec-ch-device-memory: '8'
              dpr: '1'
              sec-ch-dpr: '1'
              viewport-width: '1366'
              sec-ch-viewport-width: '1366'
              rtt: '50'
              downlink: '10'
              ect: 4g
              sec-ch-ua-platform-version: '"10.0.0"'
            body:
              k: smartphone
              i: aps
              ref: nb_sb_ss_ts-doa-p_2_3
              crid: 18B2Y3Q72EF02
              sprefix: SMA,aps,389
          - url: >-
              https://images-na.ssl-images-amazon.com/images/S/apesafeframe/ape/sf/desktop/sf-1.50.25d10cda.html
            method: GET
            label: >-
              https://images-na.ssl-images-amazon.com/images/S/apesafeframe/ape/sf/desktop/sf-1.50.25d10cda.html
            headers: {}
          - url: >-
              https://images-na.ssl-images-amazon.com/images/S/apesafeframe/ape/sf/desktop/sf-1.50.25d10cda.html
            method: GET
            label: >-
              https://images-na.ssl-images-amazon.com/images/S/apesafeframe/ape/sf/desktop/sf-1.50.25d10cda.html
            headers: {}
          - url: >-
              https://aax-us-iad.amazon.com/x/c/JAvoOFbLn6LJPNbFl_6pecsAAAGWqDTyAwEAAAH2AQBvbm9fdHhuX2JpZDcgICBvbm9fdHhuX2ltcDEgICAOF3np/https://www.amazon.com.br/dp/B0DXR6MKR8/
            method: GET
            label: >-
              https://aax-us-iad.amazon.com/x/c/JAvoOFbLn6LJPNbFl_6pecsAAAGWqDTyAwEAAAH2AQBvbm9fdHhuX2JpZDcgICBvbm9fdHhuX2ltcDEgICAOF3np/https://www.amazon.com.br/dp/B0DXR6MKR8/
            think-time: 5892ms
            headers: {}
            body:
              _encoding: UTF8
              pd_rd_i: B0DXR6MKR8
              ref_: sbx_be_s_sparkle_ssd_img
              qid: '1746578764'
              pd_rd_w: CXlQD
              content-id: >-
                amzn1.sym.0af9561b-236a-4456-ac39-e3caccb7758c:amzn1.sym.0af9561b-236a-4456-ac39-e3caccb7758c
              pf_rd_p: 0af9561b-236a-4456-ac39-e3caccb7758c
              pf_rd_r: CDGB1X946Z9K091QX6NW
              pd_rd_wg: ntqtZ
              pd_rd_r: 84073811-983e-47a1-947a-bc1875b70c3b
              pd_rd_plhdr: t
          - url: https://s.amazon-adsystem.com/iu3
            method: GET
            label: https://s.amazon-adsystem.com/iu3
            headers: {}
            body:
              d: amazon.com.br
              slot: navFooter
              a2: >-
                0101088fa57b53267245ce1297dcc755f517ae9c9eeb22dbc19ce1aa3dcce18d8d23
              old_oo: '0'
              ts: '1746578773325'
              s: AbxLLIYz7xPjTZvJl6FILbAuOXdvqMI2IJ5sNPQ6UGlZ
              gdpr_consent: ''
              gdpr_consent_avl: ''
              cb: '1746578773325'
          - url: https://s.amazon-adsystem.com/v3/pr
            method: GET
            label: https://s.amazon-adsystem.com/v3/pr
            headers: {}
            body:
              exlist: imdb_nsln_n-sk_n-lucid_bk_n-samba.tv_n-telaria_adelphic
              fv: '1.0'
              a: cm
              dmt: '1'
              gdpr_consent: ''
          - url: https://www.amazon.com.br/cart/ref=dp_atch_dss_cart
            method: GET
            label: https://www.amazon.com.br/cart/ref=dp_atch_dss_cart
            think-time: 14116ms
            headers:
              device-memory: '8'
              sec-ch-device-memory: '8'
              dpr: '1'
              sec-ch-dpr: '1'
              viewport-width: '1366'
              sec-ch-viewport-width: '1366'
              rtt: '50'
              downlink: '10'
              ect: 4g
              sec-ch-ua-platform-version: '"10.0.0"'
            body: {}
          - url: https://s.amazon-adsystem.com/iu3
            method: GET
            label: https://s.amazon-adsystem.com/iu3
            headers: {}
            body:
              d: amazon.com.br
              slot: navFooter
              a2: >-
                0101088fa57b53267245ce1297dcc755f517ae9c9eeb22dbc19ce1aa3dcce18d8d23
              old_oo: '0'
              ts: '1746578789713'
              s: AegHemti8sAUjJYDn-xouYr7M0ThA2LJHktOi-qc4iSq
              gdpr_consent: ''
              gdpr_consent_avl: ''
              cb: '1746578789713'
          - url: https://s.amazon-adsystem.com/v3/pr
            method: GET
            label: https://s.amazon-adsystem.com/v3/pr
            headers: {}
            body:
              exlist: imdb_nsln_n-sk_n-lucid_bk_n-samba.tv_n-telaria_adelphic
              fv: '1.0'
              a: cm
              dmt: '1'
              gdpr_consent: ''
          - url: https://www.amazon.com.br/gp/bestsellers/
            method: GET
            label: https://www.amazon.com.br/gp/bestsellers/
            think-time: 5328ms
            headers:
              device-memory: '8'
              sec-ch-device-memory: '8'
              dpr: '1'
              sec-ch-dpr: '1'
              viewport-width: '1366'
              sec-ch-viewport-width: '1366'
              rtt: '50'
              downlink: '10'
              ect: 4g
              sec-ch-ua-platform-version: '"10.0.0"'
            body:
              ref_: nav_em_cs_bestsellers_0_1_1_2
          - url: https://s.amazon-adsystem.com/iu3
            method: GET
            label: https://s.amazon-adsystem.com/iu3
            headers: {}
            body:
              d: amazon.com.br
              slot: navFooter
              a2: >-
                0101088fa57b53267245ce1297dcc755f517ae9c9eeb22dbc19ce1aa3dcce18d8d23
              old_oo: '0'
              ts: '1746578797324'
              s: AW4QU6x30g6sMjcLwSR1D1IDS7VP7EQQ_VeOGgEPTuo5
              gdpr_consent: ''
              gdpr_consent_avl: ''
              cb: '1746578797324'
          - url: https://s.amazon-adsystem.com/v3/pr
            method: GET
            label: https://s.amazon-adsystem.com/v3/pr
            headers: {}
            body:
              exlist: nsln_n-sk_n-lucid_bk_n-samba.tv_n-telaria_adelphic
              fv: '1.0'
              a: cm
              dmt: '1'
              gdpr_consent: ''
          - url: >-
              https://www.amazon.com.br/gp/bestsellers/grocery/ref=zg_bs_nav_grocery_0
            method: GET
            label: >-
              https://www.amazon.com.br/gp/bestsellers/grocery/ref=zg_bs_nav_grocery_0
            think-time: 1081ms
            headers:
              device-memory: '8'
              sec-ch-device-memory: '8'
              dpr: '1'
              sec-ch-dpr: '1'
              viewport-width: '1366'
              sec-ch-viewport-width: '1366'
              rtt: '50'
              downlink: '10'
              ect: 4g
              sec-ch-ua-platform-version: '"10.0.0"'
          - url: https://s.amazon-adsystem.com/iu3
            method: GET
            label: https://s.amazon-adsystem.com/iu3
            headers: {}
            body:
              d: amazon.com.br
              slot: navFooter
              a2: >-
                0101088fa57b53267245ce1297dcc755f517ae9c9eeb22dbc19ce1aa3dcce18d8d23
              old_oo: '0'
              ts: '1746578802186'
              s: AQ-xlcaT1k0QB1lRNmzeKMTE7PVO-qrRzbsYA_HP4mQ1
              gdpr_consent: ''
              gdpr_consent_avl: ''
              cb: '1746578802186'
          - url: https://s.amazon-adsystem.com/v3/pr
            method: GET
            label: https://s.amazon-adsystem.com/v3/pr
            headers: {}
            body:
              exlist: nsln_n-sk_n-lucid_bk_n-samba.tv_n-telaria_adelphic
              fv: '1.0'
              a: cm
              dmt: '1'
              gdpr_consent: ''